app/controllers/books_controller.rb

  def index
    books = Book.all
---
SELECT "books".* FROM "books"

  def show
    book = Book.find_by(id: params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "author", "page_count", "img", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)